In [1]:
import sklearn as skn
import pandas as pd
import numpy as np

In [7]:
data = {"Name":['Chandrahsh','Kal','Jone','Anna','Ng'],
        "Age":[20,None,22,None,25],
        "Salary":[150000,120000,None,130000,250000]}

df = pd.DataFrame(data)
# df.head()
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    5 non-null      object
 1   Age     3 non-null      float64
 2   Salary  4 non-null      float64
dtypes: float64(2), object(1)
memory usage: 252.0+ bytes

check missing data in present

In [3]:
df.isnull().sum()

Name      0
Age       2
Salary    1
dtype: int64

In [4]:
df.isnull().mean() *100

Name       0.0
Age       40.0
Salary    20.0
dtype: float64

### FILL MEAN VALUE IN MISSING PLACE

In [8]:
df["Age"].fillna(df['Age'].mean(), inplace=True)
df['Salary'].fillna(df['Salary'].mean(), inplace=True)
df

C:\Users\hp\AppData\Local\Temp\ipykernel_25404\1099812130.py:1: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df["Age"].fillna(df['Age'].mean(), inplace=True)
C:\Users\hp\AppData\Local\Temp\ipykernel_25404\1099812130.py:2: FutureWarning: A value is trying to be set on a copy of a DataFrame or Series through chained assignment using an inplace method.
The behavior will change in pandas 3.0. This inplace method will never work because the intermediate object on which we are setting values always behaves as a copy.

For example, when doing 'df[col].method(value, inplace=True)', try using 'df.method({col: value}, inplace=True)' or df[col] = df[col].method(value) instead, to perform the operation inplace on the original object.


  df['Salary'].fillna(df['Salary'].mean(), inplace=True)

         Name        Age    Salary
0  Chandrahsh  20.000000  150000.0
1         Kal  22.333333  120000.0
2        Jone  22.000000  162500.0
3        Anna  22.333333  130000.0
4          Ng  25.000000  250000.0

# drop NaN ROW

In [6]:
df.dropna()

         Name        Age    Salary
0  Chandrahsh  20.000000  150000.0
1         Kal  22.333333  120000.0
2        Jone  22.000000  162500.0
3        Anna  22.333333  130000.0
4          Ng  25.000000  250000.0